xml/ChartsOfAccounts/Личный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<ChartOfAccounts>
		<Properties>
			<Name>Личный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

xml/Enums/ВидыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пассивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктивноПассивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/ChartsOfAccounts/Личный/Forms/ФормаСчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вид счета (активный, пассивный)
	пВид = ТекущийОбъект.ВидСчета.Вид;
	Если пВид=Перечисления.ВидыСчетов.Активный Тогда
		ТекущийОбъект.Вид=ВидСчета.Активный;		
	ИначеЕсли пВид=Перечисления.ВидыСчетов.Пассивный Тогда
		ТекущийОбъект.Вид=ВидСчета.Пассивный;		
	ИначеЕсли пВид=Перечисления.ВидыСчетов.АктивноПассивный Тогда
		ТекущийОбъект.Вид=ВидСчета.АктивноПассивный;		
	КонецЕсли;
	// Валюта
	Если ТекущийОбъект.Валюта <> Константы.ВалютаУчета.Получить() Тогда
		ТекущийОбъект.Валютный = Истина;	
	КонецЕсли; 
	
КонецПроцедуры
